application/misc/price_sample_request.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
   xmlns:tns="http://localhost/soappractice/stocksserver/">
   <SOAP-ENV:Body>
      <tns:StocksServer.price xmlns:tns="http://localhost/soappractice/stocksserver/">
         <symbol xsi:type="xsd:string">FOO</symbol>
      </tns:StocksServer.price>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>